Revit 2027 API
NavisworksExportOptions.DivideFileIntoLevels Property
 True to divide file into levels, false otherwise. Default value is true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool DivideFileIntoLevels { get; set; }
Public Property DivideFileIntoLevels As Boolean
	Get
	Set
public:
property bool DivideFileIntoLevels {
	bool get ();
	void set (bool value);
}
member DivideFileIntoLevels : bool with get, set
Property Value
Boolean
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace